In [3]:
import pandas as pd
df=pd.read_csv("titanic1.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [4]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [5]:
target=df.Survived
inputs=df.drop('Survived',axis='columns')

In [6]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head

<bound method NDFrame.head of      female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]>

In [7]:
inputs=pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [8]:
inputs.drop('Sex',axis='columns',inplace=True)

In [9]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [10]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [12]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [49]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2)

In [50]:
len(X_train)

712

In [51]:
len(X_test)

179

In [52]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [53]:
model.fit(X_train,y_train)

GaussianNB()

In [54]:
model.score(X_test,y_test)

0.8156424581005587

In [55]:
X_test[:10]

     Pclass        Age     Fare  female  male
524       3  29.699118   7.2292       0     1
863       3  29.699118  69.5500       1     0
55        1  29.699118  35.5000       0     1
866       2  27.000000  13.8583       1     0
96        1  71.000000  34.6542       0     1
466       2  29.699118   0.0000       0     1
22        3  15.000000   8.0292       1     0
575       3  19.000000  14.5000       0     1
857       1  51.000000  26.5500       0     1
468       3  29.699118   7.7250       0     1

In [56]:
y_test[:10]

524    0
863    0
55     1
866    1
96     0
466    0
22     1
575    0
857    1
468    0
Name: Survived, dtype: int64

In [57]:
model.predict(X_test[:10])

array([0, 1, 0, 1, 0, 0, 1, 0, 0, 0], dtype=int64)

In [58]:
model.predict_proba(X_test[:10])

array([[0.9901917 , 0.0098083 ],
       [0.033818  , 0.966182  ],
       [0.91183856, 0.08816144],
       [0.04946397, 0.95053603],
       [0.84450766, 0.15549234],
       [0.97693504, 0.02306496],
       [0.08218948, 0.91781052],
       [0.98852946, 0.01147054],
       [0.9156598 , 0.0843402 ],
       [0.99021755, 0.00978245]])

# SPAM EMAIL

In [59]:
import pandas as pd
df=pd.read_csv("spam.csv")
df.head()

  Category                                            Message
0      ham  Go until jurong point, crazy.. Available only ...
1      ham                      Ok lar... Joking wif u oni...
2     spam  Free entry in 2 a wkly comp to win FA Cup fina...
3      ham  U dun say so early hor... U c already then say...
4      ham  Nah I don't think he goes to usf, he lives aro...

In [60]:
df.groupby('Category').describe()

         Message                                                            \
           count unique                                                top
Category
ham         4825   4516                             Sorry, I'll call later
spam         747    641  Please call our customer service representativ...


         freq
Category
ham        30
spam        4

In [64]:
df['spam']=df['Category'].apply(lambda x: 1 if x=='spam' else 0)
df.head()

  Category                                            Message  spam
0      ham  Go until jurong point, crazy.. Available only ...     0
1      ham                      Ok lar... Joking wif u oni...     0
2     spam  Free entry in 2 a wkly comp to win FA Cup fina...     1
3      ham  U dun say so early hor... U c already then say...     0
4      ham  Nah I don't think he goes to usf, he lives aro...     0

In [65]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(df.Message,df.spam,test_size=0.25)

In [66]:
from sklearn.feature_extraction.text import CountVectorizer
v= CountVectorizer()
X_train_count=v.fit_transform(X_train.values)
X_train_count.toarray()[:3]

array([[0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0]], dtype=int64)

In [67]:
X_train.values

array(['how tall are you princess?', 'How was txting and driving',
       'Ya but it cant display internal subs so i gotta extract them',
       ..., "I'm going for bath will msg you next  &lt;#&gt;  min..",
       "Sorry, I can't help you on this.",
       "Science tells that chocolate will melt under the sunlight. Please don't walk under the sunlight. BCoz,I don't want to loss a sweet friend."],
      dtype=object)

In [71]:
from sklearn.naive_bayes import MultinomialNB
model=MultinomialNB()
model.fit(X_train_count,y_train)

MultinomialNB()

In [73]:
emails = [
    'Hey mohan, can we get together to watch football game tomorrow?',
    'Upto 20% discount on parking, exclusive offer just for you. Dont miss this reward!'
]
emails_count = v.transform(emails)
model.predict(emails_count)

array([0, 1], dtype=int64)

In [74]:
X_test_count=v.transform(X_test)
model.score(X_test_count,y_test)

0.9877961234745154

In [77]:
from sklearn.pipeline import Pipeline
clf=Pipeline([
    ('vectorizer',CountVectorizer()),
    ('nb',MultinomialNB())
])

In [78]:
clf.fit(X_train,y_train)

Pipeline(steps=[('vectorizer', CountVectorizer()), ('nb', MultinomialNB())])

In [79]:
clf.score(X_test,y_test)

0.9877961234745154

In [81]:
clf.predict(emails)

array([0, 1], dtype=int64)